[
  {
    "type": "Personal Project",
    "title": "Personal Blog (Headless CMS)",
    "description": "Since I found effectiveness and value in documenting the new things I learn, I built myself a blog where I can share my knowledge. This blog is managed via Contentful - a content management system which allows the delivery of its content over APIs. I also used Gatsby (a static site generator) to speed up my development process while maintaining optimal performance.",
    "demoURL": "https://blog.ifedaviid.com/",
    "githubURL": "https://github.com/IfeoluwaDavid/ifedaviid-blog",
    "stack": ["React", "Gatsby", "Contentful"]
  },
  {
    "type": "Academic Project",
    "title": "Token Based Two-factor Authentication",
    "description": "A project during my software safety & security course at the University. The task was to build a web app authentication system resistant to shoulder-surfing. The project also required a database implementation of access control matrices. It was developed using HTML, CSS, JavaScript & PHP. It uses a relational MySQL database (PHPMYADMIN). Preview the end-product on the GitHub readme section.",
    "githubURL": "https://github.com/IfeoluwaDavid/token-based-2FA#readme",
    "stack": ["PHP", "HTML", "CSS", "JS", "MySQL"]
  },
  {
    "type": "Academic Project",
    "title": "University Registration System",
    "description": "This Java desktop application was developed using the Object-Oriented Client-Server Framework (OCSF). It helps manage academic-related operations such as student enrollment, searching and registration or courses, student grading, designation of instructors to courses, creation of courses and departments. User categories include students, faculty instructors and administrative staff members. More info available on the GitHub readme section.",
    "githubURL": "https://github.com/IfeoluwaDavid/university-registration-system-urs#readme",
    "stack": ["Java"]
  },
  {
    "type": "Academic Project",
    "title": "PartCribber (Web)",
    "description": "My final college year project. An online web and mobile application used by laboratory technicians and students for managing records of equipment rentals during engineering lab sessions. The web application was developed using HTML, CSS, JavaScript & PHP while, its native mobile application was built using Java and specifically for Android devices.",
    "githubURL": "https://github.com/IfeoluwaDavid/PCD-Web-App-Project#readme",
    "stack": ["PHP", "HTML", "CSS", "JS", "MySQL"]
  }
]
